# DoesFaceHaveEnoughLoopsAndVertices Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilder..::..DoesFaceHaveEnoughLoopsAndVertices Method
TessellatedShapeBuilder Class See Also
---
Checks whether 'face' has enough loops and vertcies to be valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool DoesFaceHaveEnoughLoopsAndVertices(
	TessellatedFace face
)
```

Visual Basic
---
```text
Public Function DoesFaceHaveEnoughLoopsAndVertices ( _
	face As TessellatedFace _
) As Boolean
```

Visual C++
---
```text
public:
bool DoesFaceHaveEnoughLoopsAndVertices(
	TessellatedFace^ face
)
```

# ### Parameters
face
    Type: Autodesk.Revit.DB..::..TessellatedFace The face to check.
# Remarks
Face 'face' is not modified.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace